Data/TestFiles/cases/BatteryCooling/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
    battery
    {
        type        wall;
    }

    inlet
    {
        type        patch;
    }

    outlet
    {
        type        patch;
    }

    wall
    {
        type        wall;
    }

    defaultFaces
    {
        type        wall;
    }

)

// ************************************************************************* //
